The  TriangulationInterfaceForTriangulatedShellComponent  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  TriangulationInterface  .)
 See Also
  TriangulationInterfaceForTriangulatedShellComponent Class
  Autodesk.Revit.DB Namespace